# Titanic - Kaggle Competition

### Introduction

##### The titanic was one of the world's greatest tragedies as well as one of the most unexpected ones, as the ship - the biggest in the world at the time, and widely regarded as "unsinkable" - has sunk on the first voyage after hitting an iceberg. Most of the 2200 passengers did not survive the accident. Our analysis tries to explore, using the available information, "who" survived - that is, what characteristics determined if a passenger will get a seat on a lifeboat or not. It it status, is it sex, is it age, is it all of it and more? Or was it all mere luck?

##### Target audience
##### Although nothing can be done for the victims of the titanic anymore, the tragedy is worth exploring in order to understand human behaviour in critical situations. Social Study scholars may want to explore how does one decide which life is worth saving, or in other words, how is the value of the life measured (at least how it was back in the days of the titanic). It is the case that in life and death situations, all lives are equal? Or is it the case that some lives are valued more than others, and if so, what determines how?

### Data

##### For the purpose of this analysis, the dataset provided by Kaggle will be used. The data on the approximately 1300 passengers is already split into training and testing subsets. Below is a quick overview of the data structure:

In [1]:
import pandas as pd
train = pd.read_csv("https://raw.githubusercontent.com/LucianChiriac/Coursera_Capstone/master/titanic_datasets/train.csv")
test = pd.read_csv("https://raw.githubusercontent.com/LucianChiriac/Coursera_Capstone/master/titanic_datasets/test.csv")
train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

##### PassengerId - a unique identifier for each passenger

##### Survived - takes values 0 for "not survived" and 1 for "survived"

##### Pclass - the class a passenger was travelling in, with values 1 to 3 (1 being first class, "the highest", and 3 being third class)

##### Name - unique name value for each passenger

##### Sex - indicates wether passenger is "male" or "female"

##### Age - numerical column indicating the age of a passenger in years

##### SibSp - number of Siblings/Spouses acommpanying a passenger on board

##### Parch - number of Parents/Children accompanying a passenger on board

##### Ticket - Ticket number

##### Fare - amount in dollars that was paid for the ticket

##### Cabin - the cabin number allocated to a passenger

##### Embarked - three values - C,Q,S indicating where the passenger has embarked from (Cherbourg, Queenstown, Southampton)

#### In the following section each variable, as well as the interactions between them will be explored in more detail.